try:
    number = int(input("Введите число от 0 до 99 "))
    if number > 99 or number < 0:
        print("Error")
    else:
        list0 = ["Ноль","Один","Два","Три","Четыре","Пять","Шесть","Семь","Восемь","Девять", "Десять","Одиннадцать","Двеннадцать","Тренадцать","Четырнадцать","Пятнадцать","Шестнадцать","Семнадцать","Восемнадцать","Девятнадцать"]
        list1 = ["","","Двадцать","Тридцать","Сорок","Пятьдесят","Шестьдесят","Семьдесят","Восемьдесят","Девяносто"]
        if number < 20:
            print(list0[number])
        elif number % 10 == 0:
            print(list1[number//10])
        else:
            print(list1[number//10], list0[number%10])
        
except ValueError:
    print ("Нужно ввести число")
